In [1]:
import numpy as np
import pandas as pd

In [2]:
df=pd.read_excel("filtered_transactions.xlsx")
df

      customer_id           name transaction_date       amount category
0             103  Charlie Davis       2022-01-01   759.037390        A
1             436    Alice Brown       2022-01-01  1096.181632        C
2             861    Alice Brown       2022-01-02  1158.623597        B
3             271     Bob Wilson       2022-01-02   859.027857        -
4             107     John Smith       2022-01-02   712.566977        C
...           ...            ...              ...          ...      ...
1045           85     John Smith       2023-12-27   761.082210        C
1046           78    Alice Brown       2023-12-27  1003.574745        B
1047          457  Charlie Davis       2023-12-28   832.511670        C
1048          878  Charlie Davis       2023-12-28   723.357978        B
1049            1     Bob Wilson       2023-12-30   721.611291        C

[1050 rows x 5 columns]

In [3]:
df.to_csv("filtered_transactions.csv",index=False)
df

      customer_id           name transaction_date       amount category
0             103  Charlie Davis       2022-01-01   759.037390        A
1             436    Alice Brown       2022-01-01  1096.181632        C
2             861    Alice Brown       2022-01-02  1158.623597        B
3             271     Bob Wilson       2022-01-02   859.027857        -
4             107     John Smith       2022-01-02   712.566977        C
...           ...            ...              ...          ...      ...
1045           85     John Smith       2023-12-27   761.082210        C
1046           78    Alice Brown       2023-12-27  1003.574745        B
1047          457  Charlie Davis       2023-12-28   832.511670        C
1048          878  Charlie Davis       2023-12-28   723.357978        B
1049            1     Bob Wilson       2023-12-30   721.611291        C

[1050 rows x 5 columns]

In [4]:
df

      customer_id           name transaction_date       amount category
0             103  Charlie Davis       2022-01-01   759.037390        A
1             436    Alice Brown       2022-01-01  1096.181632        C
2             861    Alice Brown       2022-01-02  1158.623597        B
3             271     Bob Wilson       2022-01-02   859.027857        -
4             107     John Smith       2022-01-02   712.566977        C
...           ...            ...              ...          ...      ...
1045           85     John Smith       2023-12-27   761.082210        C
1046           78    Alice Brown       2023-12-27  1003.574745        B
1047          457  Charlie Davis       2023-12-28   832.511670        C
1048          878  Charlie Davis       2023-12-28   723.357978        B
1049            1     Bob Wilson       2023-12-30   721.611291        C

[1050 rows x 5 columns]

Summarize data

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1050 entries, 0 to 1049
Data columns (total 5 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   customer_id       1050 non-null   int64
 1   name              1050 non-null   object
 2   transaction_date  1050 non-null   datetime64[ns]
 3   amount            1050 non-null   float64
 4   category          1050 non-null   object
dtypes: datetime64[ns](1), float64(1), int64(1), object(2)
memory usage: 41.1+ KB

In [6]:
df.describe()

       customer_id               transaction_date       amount
count  1050.000000                           1050  1050.000000
mean    503.876190  2023-01-01 05:44:13.714285568   999.641386
min       1.000000            2022-01-01 00:00:00   700.080816
25%     239.500000            2022-07-02 06:00:00   855.583776
50%     506.000000            2022-12-29 12:00:00  1000.301415
75%     760.500000            2023-07-06 00:00:00  1152.513524
max     999.000000            2023-12-30 00:00:00  1299.008507
std     291.250412                            NaN   173.802633

In [7]:
df["amount"].describe()

count    1050.000000
mean      999.641386
std       173.802633
min       700.080816
25%       855.583776
50%      1000.301415
75%      1152.513524
max      1299.008507
Name: amount, dtype: float64

Sorting :

In [8]:
df

      customer_id           name transaction_date       amount category
0             103  Charlie Davis       2022-01-01   759.037390        A
1             436    Alice Brown       2022-01-01  1096.181632        C
2             861    Alice Brown       2022-01-02  1158.623597        B
3             271     Bob Wilson       2022-01-02   859.027857        -
4             107     John Smith       2022-01-02   712.566977        C
...           ...            ...              ...          ...      ...
1045           85     John Smith       2023-12-27   761.082210        C
1046           78    Alice Brown       2023-12-27  1003.574745        B
1047          457  Charlie Davis       2023-12-28   832.511670        C
1048          878  Charlie Davis       2023-12-28   723.357978        B
1049            1     Bob Wilson       2023-12-30   721.611291        C

[1050 rows x 5 columns]

In [9]:
df.sort_values(by="amount",ascending=True)

     customer_id           name transaction_date       amount category
795          718     Bob Wilson       2023-07-10   700.080816        A
905          369     John Smith       2023-09-27   700.812175        B
518          393     Bob Wilson       2022-12-26   700.939063        A
112          252    Alice Brown       2022-03-25   701.930958        A
802          144    Alice Brown       2023-07-15   702.291954        C
..           ...            ...              ...          ...      ...
980          732    Alice Brown       2023-11-09  1296.891576        C
434          470     Bob Wilson       2022-11-03  1297.262510        C
103          958     Bob Wilson       2022-03-17  1297.800603        B
720          253  Charlie Davis       2023-05-17  1298.692513        B
145          675     John Smith       2022-04-12  1299.008507        C

[1050 rows x 5 columns]

In [10]:
df.sort_values(by="amount",ascending=False)

     customer_id           name transaction_date       amount category
145          675     John Smith       2022-04-12  1299.008507        C
720          253  Charlie Davis       2023-05-17  1298.692513        B
103          958     Bob Wilson       2022-03-17  1297.800603        B
434          470     Bob Wilson       2022-11-03  1297.262510        C
980          732    Alice Brown       2023-11-09  1296.891576        C
..           ...            ...              ...          ...      ...
802          144    Alice Brown       2023-07-15   702.291954        C
112          252    Alice Brown       2022-03-25   701.930958        A
518          393     Bob Wilson       2022-12-26   700.939063        A
905          369     John Smith       2023-09-27   700.812175        B
795          718     Bob Wilson       2023-07-10   700.080816        A

[1050 rows x 5 columns]

In [11]:
df.sort_values(by="name",ascending=True,inplace=True)

In [12]:
df.sort_values(by=["name","amount"],ascending=[True,False],inplace=True)

In [13]:
df

     customer_id         name transaction_date       amount category
980          732  Alice Brown       2023-11-09  1296.891576        C
269          497  Alice Brown       2022-07-11  1290.993794        -
218          682  Alice Brown       2022-06-01  1288.778254        A
676          906  Alice Brown       2023-04-12  1288.592427        A
689          497  Alice Brown       2023-04-27  1288.443606        B
..           ...          ...              ...          ...      ...
876          167   John Smith       2023-09-02   711.596579        B
899          973   John Smith       2023-09-23   710.531418        B
894          895   John Smith       2023-09-20   710.168599        C
883          451   John Smith       2023-09-09   705.954293        C
905          369   John Smith       2023-09-27   700.812175        B

[1050 rows x 5 columns]

filtering :

In [14]:
df

     customer_id         name transaction_date       amount category
980          732  Alice Brown       2023-11-09  1296.891576        C
269          497  Alice Brown       2022-07-11  1290.993794        -
218          682  Alice Brown       2022-06-01  1288.778254        A
676          906  Alice Brown       2023-04-12  1288.592427        A
689          497  Alice Brown       2023-04-27  1288.443606        B
..           ...          ...              ...          ...      ...
876          167   John Smith       2023-09-02   711.596579        B
899          973   John Smith       2023-09-23   710.531418        B
894          895   John Smith       2023-09-20   710.168599        C
883          451   John Smith       2023-09-09   705.954293        C
905          369   John Smith       2023-09-27   700.812175        B

[1050 rows x 5 columns]

In [15]:
df[df["amount"]>1000]

     customer_id         name transaction_date       amount category
980          732  Alice Brown       2023-11-09  1296.891576        C
269          497  Alice Brown       2022-07-11  1290.993794        -
218          682  Alice Brown       2022-06-01  1288.778254        A
676          906  Alice Brown       2023-04-12  1288.592427        A
689          497  Alice Brown       2023-04-27  1288.443606        B
..           ...          ...              ...          ...      ...
324          187   John Smith       2022-08-19  1016.439773        A
136          344   John Smith       2022-04-09  1010.361434        C
493          323   John Smith       2022-12-10  1007.600636        C
501          872   John Smith       2022-12-15  1004.447163        C
750          869   John Smith       2023-06-08  1000.374561        -

[526 rows x 5 columns]

In [16]:
df["name"][df["amount"]>1000]

980    Alice Brown
269    Alice Brown
218    Alice Brown
676    Alice Brown
689    Alice Brown
          ...
324     John Smith
136     John Smith
493     John Smith
501     John Smith
750     John Smith
Name: name, Length: 526, dtype: object

In [17]:
df[(df["amount"]>1000)&(df["category"]=="B")]

      customer_id         name transaction_date       amount category
689           497  Alice Brown       2023-04-27  1288.443606        B
1034          870  Alice Brown       2023-12-17  1270.557157        B
744           420  Alice Brown       2023-06-05  1268.612816        B
244           973  Alice Brown       2022-06-15  1267.418888        B
213           699  Alice Brown       2022-05-29  1262.093477        B
...           ...          ...              ...          ...      ...
121           792   John Smith       2022-03-28  1047.990272        B
492           256   John Smith       2022-12-10  1043.229186        B
323           124   John Smith       2022-08-18  1035.853410        B
783           699   John Smith       2023-07-03  1031.500580        B
16            100   John Smith       2022-01-10  1018.181280        B

[134 rows x 5 columns]

Aggregation :

In [18]:
print(df["amount"].min())

700.080816

In [19]:
(df["amount"].max())

np.float64(1299.008507)

In [20]:
(df["amount"].sum())

np.float64(1049623.455648)

In [21]:
(df["amount"].mean())

np.float64(999.6413863314284)

In [22]:
(df["amount"].count())

np.int64(1050)

In [23]:
df["name"][df["amount"]==df["amount"].max()]

145    John Smith
Name: name, dtype: object

Mearge data & join data.

In [24]:
# df1 = {
#     "ID":[1,2,3],
#     "name":["alice","bob","charlie"],
#     "age":[35,22,45]
# }

In [25]:
df1_dict = {
    "ID":[1,2,3],
    "name":["alice","bob","charlie"],
    "age":[35,22,45]
}

df2_dict = {
    "ID":[3,4],
    "salary":[45000,35000]
}

# Convert to DataFrame
df1 = pd.DataFrame(df1_dict)
df2 = pd.DataFrame(df2_dict)

# Merge
result = pd.merge(df1, df2, on="ID", how="inner")
print(result)

   ID     name  age  salary
0   3  charlie   45   45000

In [26]:
# df2 = {
#     "ID":[3,4],
#     "salary":[45000,35000]
# }

In [27]:
# print(type(df1))
# print(type(df2))

In [28]:
result=pd.merge(df1, df2, on="ID", how="inner")

In [29]:
print(result)

   ID     name  age  salary
0   3  charlie   45   45000

In [30]:
pd.merge(df1,df2,on="ID",how="outer")

   ID     name   age   salary
0   1    alice  35.0      NaN
1   2      bob  22.0      NaN
2   3  charlie  45.0  45000.0
3   4      NaN   NaN  35000.0

In [31]:
pd.merge(df1,df2,on="ID",how="right")

   ID     name   age  salary
0   3  charlie  45.0   45000
1   4      NaN   NaN   35000

In [32]:
pd.merge(df1,df2,on="ID",how="left")

   ID     name  age   salary
0   1    alice   35      NaN
1   2      bob   22      NaN
2   3  charlie   45  45000.0

In [33]:
pd.merge(df1,df2)

   ID     name  age  salary
0   3  charlie   45   45000

In [34]:
df1.merge(df2)

   ID     name  age  salary
0   3  charlie   45   45000

Join() :

In [35]:
df1

   ID     name  age
0   1    alice   35
1   2      bob   22
2   3  charlie   45

In [36]:
df2

   ID  salary
0   3   45000
1   4   35000

In [37]:
df3=df1.set_index("ID")

In [38]:
df4=df2.set_index("ID")

In [39]:
df3

       name  age
ID
1     alice   35
2       bob   22
3   charlie   45

In [40]:
df4

    salary
ID
3    45000
4    35000

In [41]:
df3.join(df4)

       name  age   salary
ID
1     alice   35      NaN
2       bob   22      NaN
3   charlie   45  45000.0

In [42]:
df3.join(df4,how="left")

       name  age   salary
ID
1     alice   35      NaN
2       bob   22      NaN
3   charlie   45  45000.0

In [43]:
df3.join(df4,how="right")

       name   age  salary
ID
3   charlie  45.0   45000
4       NaN   NaN   35000

In [44]:
df3.join(df4,how="inner")

       name  age  salary
ID
3   charlie   45   45000

In [45]:
df3.join(df4,how="outer")

       name   age   salary
ID
1     alice  35.0      NaN
2       bob  22.0      NaN
3   charlie  45.0  45000.0
4       NaN   NaN  35000.0